In [2]:
import pandas as pd
import numpy as np

In [4]:
my_data = np.array([[10,20,30],[20,30,40],[20,50,10],[10,15,20]])

In [5]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [6]:
my_names = ["james","Lars","Kirk","Rob"]
my_columns = ["Jan","Feb","Mar"]

In [7]:
my_data_frame = pd.DataFrame(my_data)

In [8]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [9]:
type(my_data_frame)

pandas.core.frame.DataFrame

In [10]:
new_data_frame = pd.DataFrame(my_data, index = my_names, columns = my_columns)

In [11]:
new_data_frame

       Jan  Feb  Mar
james   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [13]:
type(new_data_frame["Feb"])

pandas.core.series.Series

In [14]:
new_data_frame["Feb"]

james    20
Lars     30
Kirk     50
Rob      15
Name: Feb, dtype: int32

In [16]:
feb_series = new_data_frame["Feb"]

In [17]:
feb_series.mean()

28.75

In [18]:
feb_series.Lars

30

In [19]:
feb_series.Rob

15

In [20]:
feb_series.max()

50

In [21]:
new_data_frame["Jan"].mean()

15.0

In [22]:
new_data_frame

       Jan  Feb  Mar
james   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [23]:
new_data_frame[["Jan","Feb"]]

       Jan  Feb
james   10   20
Lars    20   30
Kirk    20   50
Rob     10   15

In [24]:
new_data_frame.loc["Lars"]

Jan    20
Feb    30
Mar    40
Name: Lars, dtype: int32

In [25]:
type(new_data_frame.loc["Lars"])

pandas.core.series.Series

In [27]:
new_data_frame.loc["Rob"].mean()

15.0

In [28]:
new_data_frame

       Jan  Feb  Mar
james   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [29]:
new_data_frame.iloc[3]

Jan    10
Feb    15
Mar    20
Name: Rob, dtype: int32

In [30]:
new_data_frame["Apr"] = new_data_frame["Mar"] * 2

In [31]:
new_data_frame

       Jan  Feb  Mar  Apr
james   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20
Rob     10   15   20   40

In [33]:
new_data_frame.drop("Rob", axis=0) 
#axis = 0 -> Row
#axis = 1 -> Coulumn

       Jan  Feb  Mar  Apr
james   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20

In [34]:
new_data_frame.drop("Apr", axis=1)

       Jan  Feb  Mar
james   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [35]:
new_data_frame

       Jan  Feb  Mar  Apr
james   10   20   30   60
Lars    20   30   40   80
Kirk    20   50   10   20
Rob     10   15   20   40

In [36]:
new_data_frame.drop("Apr", axis=1, inplace=True)

In [37]:
new_data_frame

       Jan  Feb  Mar
james   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [38]:
new_data_frame["Jan"]["Lars"]

20

In [39]:
boolean_frame = new_data_frame > 25

In [40]:
boolean_frame

         Jan    Feb    Mar
james  False  False   True
Lars   False   True   True
Kirk   False   True  False
Rob    False  False  False

In [41]:
new_data_frame[boolean_frame]

       Jan   Feb   Mar
james  NaN   NaN  30.0
Lars   NaN  30.0  40.0
Kirk   NaN  50.0   NaN
Rob    NaN   NaN   NaN

In [42]:
new_data_frame[new_data_frame > 30]

       Jan   Feb   Mar
james  NaN   NaN   NaN
Lars   NaN   NaN  40.0
Kirk   NaN  50.0   NaN
Rob    NaN   NaN   NaN

In [43]:
new_data_frame

       Jan  Feb  Mar
james   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [44]:
new_data_frame[new_data_frame["Mar"] > 25]

       Jan  Feb  Mar
james   10   20   30
Lars    20   30   40

In [45]:
new_data_frame.reset_index()

   index  Jan  Feb  Mar
0  james   10   20   30
1   Lars   20   30   40
2   Kirk   20   50   10
3    Rob   10   15   20

In [46]:
new_data_frame

       Jan  Feb  Mar
james   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [47]:
new_data_frame["NewIndex"] = ["Jam","Lar","Kir","Robert"]

In [48]:
new_data_frame

       Jan  Feb  Mar NewIndex
james   10   20   30      Jam
Lars    20   30   40      Lar
Kirk    20   50   10      Kir
Rob     10   15   20   Robert

In [49]:
new_data_frame.set_index("NewIndex")

          Jan  Feb  Mar
NewIndex
Jam        10   20   30
Lar        20   30   40
Kir        20   50   10
Robert     10   15   20

In [50]:
new_data_frame

       Jan  Feb  Mar NewIndex
james   10   20   30      Jam
Lars    20   30   40      Lar
Kirk    20   50   10      Kir
Rob     10   15   20   Robert

In [51]:
new_data_frame.drop("NewIndex", axis=1, inplace=True)

In [52]:
new_data_frame

       Jan  Feb  Mar
james   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20